In [1]:
import pandas as pd
import random

In [2]:
data ={
    'Students':['Dileep','Alex','Steve','Bill','Robert','Bob'],
    'Age':[random.randint(17,22) for age in range(6)],
    'Marks':[random.randint(0,90) for mrk in range(6)],
}

In [3]:
df = pd.DataFrame(data=data,dtype=float)
df

  Students   Age  Marks
0   Dileep  20.0   50.0
1     Alex  17.0   35.0
2    Steve  18.0    7.0
3     Bill  19.0   62.0
4   Robert  22.0    6.0
5      Bob  19.0   23.0

In [4]:
df.columns

Index(['Students', 'Age', 'Marks'], dtype='object')

In [5]:
df.index # note column index also counted

RangeIndex(start=0, stop=6, step=1)

In [6]:
df.head()

  Students   Age  Marks
0   Dileep  20.0   50.0
1     Alex  17.0   35.0
2    Steve  18.0    7.0
3     Bill  19.0   62.0
4   Robert  22.0    6.0

In [7]:
df.tail()

  Students   Age  Marks
1     Alex  17.0   35.0
2    Steve  18.0    7.0
3     Bill  19.0   62.0
4   Robert  22.0    6.0
5      Bob  19.0   23.0

In [8]:
df.head(2)

  Students   Age  Marks
0   Dileep  20.0   50.0
1     Alex  17.0   35.0

In [9]:
df.columns[0] #0th column

'Students'

In [10]:
df.index[0] #0th row index

0

In [11]:
#Acessing DICTIONARY like DataFrame 
df['Students']

0    Dileep
1      Alex
2     Steve
3      Bill
4    Robert
5       Bob
Name: Students, dtype: object

In [12]:
df['Students'][0]

'Dileep'

In [13]:
#Print columns 
df[['Students','Marks']]

  Students  Marks
0   Dileep   50.0
1     Alex   35.0
2    Steve    7.0
3     Bill   62.0
4   Robert    6.0
5      Bob   23.0

In [14]:
#Rename Columns 
# NOTE HAVE TO GIVE ALL Column names
df.columns=['Changed','Age','Marks']
df

  Changed   Age  Marks
0  Dileep  20.0   50.0
1    Alex  17.0   35.0
2   Steve  18.0    7.0
3    Bill  19.0   62.0
4  Robert  22.0    6.0
5     Bob  19.0   23.0

In [17]:
## ADDING NEW ROWS with zero index
new_row = pd.DataFrame([['Added',20.0,65]],columns=['Changed','Age','Marks'])
df = df.append(new_row)
df

  Changed   Age  Marks
0  Dileep  20.0   50.0
1    Alex  17.0   35.0
2   Steve  18.0    7.0
3    Bill  19.0   62.0
4  Robert  22.0    6.0
5     Bob  19.0   23.0
0   Added  20.0   65.0
0   Added  20.0   65.0
0   Added  20.0   65.0

In [20]:
## adding at 
i=[i for i in len(df.index)]
df.index =i
df

TypeError: 'int' object is not iterable